Repository: dungla2011/monitor_mobile_app
Catalog: lib/l10n/app_*.arb
Languages: vi

# appLoading
source: Loading...
vi: Đang tải...

# appError
source: Error
vi: Lỗi

# appSuccess
source: Success
vi: Thành công

# appCancel
source: Cancel
vi: Hủy

# appSave
source: Save
vi: Lưu

# appAdd
source: Add
vi: Thêm

# appEdit
source: Edit
vi: Sửa

# appDelete
source: Delete
vi: Xóa

# appUpdate
source: Update
vi: Cập nhật

# appBack
source: Back
vi: Quay lại

# appClose
source: Close
vi: Đóng

# appConfirm
source: Confirm
vi: Xác nhận

# appYes
source: Yes
vi: Có

# appNo
source: No
vi: Không

# appLoadingData
source: Loading data...
vi: Đang tải dữ liệu...

# appRetry
source: Retry
vi: Sửa lại

# crudInitError
source: Initialization error
vi: Lỗi khởi tạo

# crudLoadDataError
source: Data loading error
vi: Lỗi tải dữ liệu

# crudSessionExpired
source: Session expired
vi: Phiên đăng nhập hết hạn

# crudPleaseLoginAgain
source: Please login again to continue
vi: Vui lòng đăng nhập lại để tiếp tục

# crudDeleteConfirmTitle
source: Confirm deletion
vi: Xác nhận xóa

# crudDeleteConfirmMessage
source: Are you sure you want to delete {count} item(s)?
vi: Bạn có chắc chắn muốn xóa {count} item(s)?

# crudDeleteSuccess
source: Deleted successfully
vi: Xóa thành công

# crudDeleteError
source: Error deleting
vi: Lỗi khi xóa

# crudLoadingConfig
source: Loading configuration...
vi: Đang tải cấu hình...

# crudCannotLoadConfig
source: Cannot load configuration
vi: Không thể tải cấu hình

# crudLoadConfigError
source: Error loading configuration
vi: Lỗi khi tải cấu hình

# crudCannotLoadData
source: Cannot load item data
vi: Không thể tải dữ liệu item

# crudLoading
source: Loading...
vi: Đang tải...

# crudNoData
source: No data
vi: Chưa có dữ liệu

# crudAddFirstItem
source: Press + button to add new item
vi: Nhấn nút + để thêm item mới

# crudAddFirstButton
source: Add first {item}
vi: Thêm {item} đầu tiên

# crudSaveSuccess
source: Saved successfully
vi: Lưu thành công

# crudSaveError
source: Error saving
vi: Lỗi khi lưu

# crudConnectionError
source: Connection error
vi: Lỗi kết nối

# authLogin
source: Login
vi: Đăng nhập

# authLogout
source: Logout
vi: Đăng xuất

# authUsername
source: Username
vi: Tên đăng nhập

# authPassword
source: Password
vi: Mật khẩu

# authLoginSuccess
source: Login successful
vi: Đăng nhập thành công

# authLoginFailed
source: Login failed
vi: Đăng nhập thất bại

# authPleaseEnterUsername
source: Please enter username
vi: Vui lòng nhập tên đăng nhập

# authPleaseEnterPassword
source: Please enter password
vi: Vui lòng nhập mật khẩu

# monitorConfigs
source: Monitor Alerts
vi: Monitor Cảnh báo

# monitorAddItem
source: Add Monitor Item
vi: Thêm Monitor Item

# monitorEditItem
source: Edit Monitor Item
vi: Sửa Monitor Item

# monitorDeleteItem
source: Delete Monitor Item
vi: Xóa Monitor Item

# monitorAddConfig
source: Add Monitor Alert
vi: Thêm Monitor Cảnh báo

# monitorEditConfig
source: Edit Monitor Alert
vi: Sửa Monitor Cảnh báo

# monitorDeleteConfig
source: Delete Monitor Alert
vi: Xóa Monitor Cảnh báo

source: Monitor name
vi: Tên monitor

# monitorType
source: Check type
vi: Kiểu kiểm tra

# monitorUrl
source: Web/Domain/IP Link
vi: Link Web/Domain/IP

# monitorInterval
source: Check interval
vi: Khoảng thời gian kiểm tra

# monitorAlertConfig
source: Alert configuration
vi: Cấu hình cảnh báo

# monitorEnable
source: Enable monitoring
vi: Bật kiểm tra

# monitorStatus
source: Latest status
vi: Trạng thái gần nhất

# monitorLastCheck
source: Last check
vi: Kiểm tra gần nhất

# monitorAllowConsecutiveAlert
source: Allow consecutive alerts on error
vi: Cho phép gửi cảnh báo liên tiếp khi lỗi

# monitorErrorKeyword
source: Error keyword
vi: Keyword nếu lỗi

# monitorValidKeyword
source: Valid keyword
vi: Keyword nếu không lỗi

# monitorCreatedAt
source: Created at
vi: Ngày tạo

# configAlertType
source: Alert type
vi: Loại cảnh báo

# configAlertConfig
source: Alert configuration
vi: Cấu hình cảnh báo

# configEmail
source: Send Email
vi: Gửi Email

# configSms
source: Send SMS
vi: Gửi SMS

# configTelegram
source: Send Telegram
vi: Gửi Telegram

# configWebhook
source: Call Webhook
vi: Gọi Webhook

# configSelectAlertType
source: Select alert type
vi: Chọn loại cảnh báo

# validationRequired
source: Please enter {field}
vi: Vui lòng nhập {field}

# validationPleaseSelect
source: Please select {field}
vi: Vui lòng chọn {field}

# validationPleaseSelectAtLeastOne
source: Please select at least one {field}
vi: Vui lòng chọn ít nhất một {field}

# validationInvalidFormat
source: Invalid {field} format
vi: Định dạng {field} không hợp lệ

# messagesSaveSuccess
source: Saved successfully
vi: Lưu thành công

# messagesSaveFailed
source: Save failed
vi: Lưu thất bại

# messagesDeleteSuccess
source: Deleted successfully
vi: Xóa thành công

# messagesDeleteFailed
source: Delete failed
vi: Xóa thất bại

# messagesDeleteConfirm
source: Are you sure you want to delete {item}?
vi: Bạn có chắc chắn muốn xóa {item}?

# messagesNetworkError
source: Network error
vi: Lỗi kết nối mạng

# messagesServerError
source: Server error
vi: Lỗi máy chủ

# messagesUnknownError
source: Unknown error
vi: Lỗi không xác định

# messagesLoadingSettingsError
source: Error loading settings: {error}
vi: Lỗi khi tải cài đặt: {error}

# navigationHome
source: Home
vi: Trang chủ

# navigationMonitorItems
source: Monitor Items
vi: Danh sách Monitor

# navigationMonitorConfigs
source: Monitor Configs
vi: Cấu hình Cảnh báo

# navigationProfile
source: Profile
vi: Hồ sơ

# navigationSettings
source: Settings
vi: Cài đặt

# navigationNotifications
source: Notifications
vi: Thông báo

# navigationAbout
source: About
vi: Giới thiệu

# navigationWelcome
source: Welcome!
vi: Chào mừng bạn!

# settingsTitle
source: Settings
vi: Cài đặt

# settingsLanguage
source: Language
vi: Ngôn ngữ

# settingsLanguageDescription
source: Choose your preferred language
vi: Chọn ngôn ngữ ưa thích

# settingsNotifications
source: Notifications
vi: Thông báo

# settingsNotificationsDescription
source: Manage notification preferences
vi: Quản lý cài đặt thông báo

# settingsNotificationSettings
source: Notification Settings
vi: Cài đặt Thông báo

# settingsEnableNotifications
source: Enable notifications
vi: Bật thông báo

# settingsEnableNotificationsDesc
source: Receive notifications from app
vi: Nhận thông báo từ ứng dụng

# settingsNotificationSound
source: Notification sound
vi: Âm thanh thông báo

# settingsNotificationSoundNotSelected
source: Not selected
vi: Chưa chọn

# settingsVibrate
source: Vibrate
vi: Rung

# settingsVibrateDesc
source: Vibrate on notification
vi: Rung khi có thông báo

# settingsTheme
source: Theme
vi: Giao diện

# settingsThemeDescription
source: Choose app appearance
vi: Chọn giao diện ứng dụng

# settingsAbout
source: About App
vi: Về ứng dụng

# settingsAboutDescription
source: Version and app information
vi: Phiên bản và thông tin ứng dụng

# settingsVersion
source: Version
vi: Phiên bản

# settingsEnglish
source: English
vi: Tiếng Anh

# settingsVietnamese
source: Vietnamese
vi: Tiếng Việt

# settingsLight
source: Light
vi: Sáng

# settingsDark
source: Dark
vi: Tối

# settingsSystem
source: System
vi: Theo hệ thống

# settingsAppInfo
source: App Information
vi: Thông tin ứng dụng

# settingsAppName
source: App Name
vi: Tên ứng dụng

# settingsVietnameseDesc
source: Tiếng Việt (Vietnamese)
vi: Tiếng Việt (mặc định)

# settingsEnglishDesc
source: English (default)
vi: English

# settingsFrenchDesc
source: Français (French)
vi: Tiếng Pháp

# settingsGermanDesc
source: Deutsch (German)
vi: Tiếng Đức

# settingsSpanishDesc
source: Español (Spanish)
vi: Tiếng Tây Ban Nha

# settingsJapaneseDesc
source: 日本語 (Japanese)
vi: Tiếng Nhật

# settingsKoreanDesc
source: 한국어 (Korean)
vi: Tiếng Hàn

source: Language already selected
vi: Ngôn ngữ đã được chọn

# languageUpdateSuccess
source: Language updated successfully
vi: Đã cập nhật ngôn ngữ thành công

# languageChangedNotSynced
source: Language changed (not synced to server)
vi: Đã thay đổi ngôn ngữ (chưa đồng bộ lên server)

# languageChangeError
source: Error changing language
vi: Lỗi khi thay đổi ngôn ngữ

# languageUserNotLoggedIn
source: User not logged in
vi: Người dùng chưa đăng nhập

# languageSessionExpired
source: Session expired
vi: Phiên đăng nhập hết hạn

# languageConnectionError
source: Connection error
vi: Lỗi kết nối

# languageApiError
source: API error
vi: API trả về lỗi

# languageHttpError
source: HTTP Error
vi: Lỗi HTTP

# notificationSoundDefault
source: Default (System)
vi: Mặc định (Hệ thống)

# notificationSoundNone
source: None (Silent)
vi: Không (Im lặng)

# notificationSoundAlert
source: Alert
vi: Cảnh báo

# notificationSoundGentle
source: Gentle
vi: Nhẹ nhàng

# notificationSoundUrgent
source: Urgent
vi: Khẩn cấp

# notificationSoundSelectTitle
source: Select notification sound
vi: Chọn âm thanh thông báo

# notificationSoundPreview
source: Preview
vi: Nghe thử

# mobileActionNavigatingToConfig
source: Navigating to Monitor Config...
vi: Đang chuyển đến Monitor Config...

# mobileActionNavigatingToItems
source: Navigating to Monitor Items...
vi: Đang chuyển đến Monitor Items...

# mobileActionCommandNotFound
source: Command not found: "{cmd}"
vi: Không tìm thấy lệnh: "{cmd}"

# timeSeconds
source: Seconds
vi: Giây

# timeMinutes
source: Minutes
vi: Phút

# timeHours
source: Hours
vi: Giờ

# timeDays
source: Days
vi: Ngày

# timeSelectTime
source: Select time
vi: Chọn thời gian

# timeClearTime
source: Clear time
vi: Xóa thời gian

source: Time not selected
vi: Chưa chọn thời gian

# timeSecond
source: second
vi: giây

# timeMinute
source: minute
vi: phút

# timeHour
source: hour
vi: giờ

# timeDay
source: day
vi: ngày

# timeMin
source: min
vi: phút

# timeMins
source: mins
vi: phút

# timeAgo
source: ago
vi: trước

# optionsSelect
source: -Select-
vi: -Chọn-

# optionsSelectAlertType
source: -Select Alert Type-
vi: -Chọn Kiểu Alert-

# optionsWebContent
source: Web Server Active
vi: Web Server hoạt động

# profileTitle
source: Profile
vi: Hồ sơ

# profileEditProfile
source: Edit Profile
vi: Chỉnh sửa hồ sơ

# profileEditProfileTooltip
source: Edit profile
vi: Chỉnh sửa hồ sơ

# profileDisplayName
source: Display Name
vi: Tên hiển thị

# profileNoName
source: No name
vi: Chưa có tên

# profileNoUsername
source: No username
vi: Chưa có username

# profileNoEmail
source: No email
vi: Chưa có email

# profileLoggedIn
source: Logged in
vi: Đã đăng nhập

# profileLoginInfo
source: Login Information
vi: Thông tin đăng nhập

# profileLoginMethod
source: Login method
vi: Phương thức đăng nhập

# profileLoginTime
source: Login time
vi: Thời gian đăng nhập

# profileActions
source: Actions
vi: Hành động

# profileRefreshInfo
source: Refresh information
vi: Làm mới thông tin

# profileRefreshInfoDesc
source: Update latest information
vi: Cập nhật thông tin mới nhất

# profileLogoutDesc
source: Sign out of account
vi: Thoát khỏi tài khoản

# profileLogoutConfirm
source: Are you sure you want to sign out?
vi: Bạn có chắc chắn muốn đăng xuất?

# profileLoggingOut
source: Signing out...
vi: Đang đăng xuất...

# profileLogoutSuccess
source: ✅ Signed out successfully
vi: ✅ Đăng xuất thành công

# profileLogoutError
source: ❌ Error signing out: {error}
vi: ❌ Lỗi khi đăng xuất: {error}

# profileLoadError
source: Error loading information: {error}
vi: Lỗi khi tải thông tin: {error}

# profileUpdateNotSupported
source: Profile update feature is not yet supported
vi: Chức năng cập nhật hồ sơ chưa được hỗ trợ

# profileLoginMethodEmail
source: Email & Password
vi: Email & Mật khẩu

# profileLoginMethodUnknown
source: Unknown
vi: Không xác định

# aboutTitle
source: About
vi: Giới thiệu

# aboutDescription
source: Application for monitoring and managing your services.
vi: Ứng dụng giám sát và quản lý dịch vụ của bạn.

# aboutDeveloper
source: Developed by GalaxyCloud.vn
vi: Phát triển bởi GalaxyCloud.vn

# errorDialogTitle
source: Error
vi: Lỗi

# errorDialogDetails
source: Error details:
vi: Chi tiết lỗi:

# errorDialogHints
source: Hints:
vi: Gợi ý:

# errorDialogHintsEmail
source: Email hints:
vi: Gợi ý về Email:

# errorDialogHintEmailValid
source: Email must be in valid format (e.g.: user@domain.com)
vi: Email phải có định dạng hợp lệ (ví dụ: user@domain.com)

# errorDialogHintEmailMultiple
source: Multiple emails separated by commas
vi: Nhiều email cách nhau bằng dấu phẩy

# errorDialogHintEmailNoSpace
source: Should not contain extra spaces
vi: Không được chứa khoảng trắng thừa

# errorDialogHintsUrl
source: URL hints:
vi: Gợi ý về URL:

# errorDialogHintUrlValid
source: URL must be in valid format (e.g.: https://example.com)
vi: URL phải có định dạng hợp lệ (ví dụ: https://example.com)

# errorDialogHintUrlProtocol
source: Must start with http:// or https://
vi: Phải bắt đầu bằng http:// hoặc https://

# errorDialogHintUrlNoSpecial
source: Should not contain invalid special characters
vi: Không được chứa ký tự đặc biệt không hợp lệ

# errorDialogHintsPassword
source: Password hints:
vi: Gợi ý về Mật khẩu:

# errorDialogHintPasswordLength
source: Password must be at least 8 characters
vi: Mật khẩu phải có ít nhất 8 ký tự

# errorDialogHintPasswordMix
source: Should contain uppercase, lowercase, and numbers
vi: Nên chứa cả chữ hoa, chữ thường và số

# errorDialogHintPasswordNoSpace
source: Should not contain spaces
vi: Không được chứa khoảng trắng

# errorDialogHintRequired1
source: Please fill in all required fields
vi: Vui lòng điền đầy đủ các trường bắt buộc

# errorDialogHintRequired2
source: Fields with (*) are required
vi: Các trường có dấu (*) là bắt buộc

# errorDialogHintRequired3
source: Check form before submitting
vi: Kiểm tra lại form trước khi submit

# errorDialogHintDuplicate1
source: This value already exists in the system
vi: Giá trị này đã tồn tại trong hệ thống

# errorDialogHintDuplicate2
source: Please choose a different value
vi: Vui lòng chọn giá trị khác

# errorDialogHintDuplicate3
source: Check existing list before adding new
vi: Kiểm tra danh sách hiện có trước khi thêm mới

# httpErrorTechnical
source: Technical details
vi: Chi tiết kỹ thuật

# httpErrorSuggestions
source: Suggestions:
vi: Gợi ý khắc phục:

# httpErrorClose
source: Close
vi: Đóng

# httpErrorRetry
source: Retry
vi: Thử lại

# httpError400Title
source: Bad Request
vi: Yêu cầu không hợp lệ

# httpError400Desc
source: The data sent to the server is not in the correct format or missing required information.
vi: Dữ liệu gửi lên server không đúng định dạng hoặc thiếu thông tin bắt buộc.

# httpError400Hint1
source: Check all information fields
vi: Kiểm tra lại tất cả các trường thông tin

# httpError400Hint2
source: Ensure email, URL, phone number are in correct format
vi: Đảm bảo email, URL, số điện thoại có định dạng đúng

# httpError400Hint3
source: Do not leave required fields empty
vi: Không để trống các trường bắt buộc

# httpError401Title
source: Not Logged In
vi: Chưa đăng nhập

# httpError401Desc
source: Session has expired or you are not logged in to the system.
vi: Phiên đăng nhập đã hết hạn hoặc bạn chưa đăng nhập vào hệ thống.

# httpError401Hint1
source: Please log in again
vi: Vui lòng đăng nhập lại

# httpError401Hint2
source: Check network connection
vi: Kiểm tra kết nối mạng

# httpError401Hint3
source: Contact administrator if the problem persists
vi: Liên hệ quản trị viên nếu vấn đề vẫn tiếp diễn

# httpError403Title
source: Access Denied
vi: Không có quyền truy cập

# httpError403Desc
source: You do not have permission to perform this operation. Please contact administrator.
vi: Bạn không có quyền thực hiện thao tác này. Vui lòng liên hệ quản trị viên.

# httpError403Hint1
source: Contact administrator for permission
vi: Liên hệ quản trị viên để được cấp quyền

# httpError403Hint2
source: Log in with an account that has appropriate permissions
vi: Đăng nhập với tài khoản có quyền phù hợp

# httpError404Title
source: Not Found
vi: Không tìm thấy

# httpError404Desc
source: The requested resource does not exist or has been deleted.
vi: Tài nguyên yêu cầu không tồn tại hoặc đã bị xóa.

# httpError404Hint1
source: Check URL or ID again
vi: Kiểm tra lại URL hoặc ID

# httpError404Hint2
source: Refresh list and try again
vi: Làm mới danh sách và thử lại

# httpError404Hint3
source: Data may have been deleted earlier
vi: Dữ liệu có thể đã bị xóa trước đó

# httpError408Title
source: Timeout
vi: Hết thời gian chờ

# httpError408Desc
source: Request took too long. Please try again.
vi: Yêu cầu mất quá nhiều thời gian. Vui lòng thử lại.

# httpError408Hint1
source: Check internet connection
vi: Kiểm tra kết nối internet

# httpError408Hint2
source: Try again after a few seconds
vi: Thử lại sau vài giây

# httpError408Hint3
source: Contact support if error repeats
vi: Liên hệ hỗ trợ nếu lỗi lặp lại

# httpError429Title
source: Too Many Requests
vi: Quá nhiều yêu cầu

# httpError429Desc
source: You have sent too many requests in a short time. Please wait and try again.
vi: Bạn đã gửi quá nhiều yêu cầu trong thời gian ngắn. Vui lòng đợi và thử lại.

# httpError429Hint1
source: Wait a few minutes before trying again
vi: Đợi một vài phút trước khi thử lại

# httpError429Hint2
source: Avoid sending requests continuously
vi: Tránh gửi yêu cầu liên tục

# httpError500Title
source: Server Error
vi: Lỗi máy chủ

# httpError500Desc
source: Server encountered an error while processing the request. Please try again later.
vi: Server gặp lỗi khi xử lý yêu cầu. Vui lòng thử lại sau.

# httpError500Hint1
source: Wait a few minutes then try again
vi: Đợi vài phút rồi thử lại

# httpError500Hint2
source: Contact technical support if error persists
vi: Liên hệ bộ phận kỹ thuật nếu lỗi vẫn tiếp diễn

# httpError500Hint3
source: Save important data before retrying
vi: Lưu dữ liệu quan trọng trước khi thử lại

# httpError503Title
source: Service Temporarily Unavailable
vi: Dịch vụ tạm thời không khả dụng

# httpError503Desc
source: Server is under maintenance or overloaded. Please try again later.
vi: Server đang bảo trì hoặc quá tải. Vui lòng thử lại sau.

# httpError503Hint1
source: Try again after 5-10 minutes
vi: Thử lại sau 5-10 phút

# httpError503Hint2
source: Check maintenance notifications from administrator
vi: Kiểm tra thông báo bảo trì từ quản trị viên

# httpError503Hint3
source: Contact technical support if urgent
vi: Liên hệ hỗ trợ kỹ thuật nếu cần gấp

# httpErrorDefaultTitle
source: Unknown Error
vi: Lỗi không xác định

# httpErrorDefaultDesc
source: An unexpected error occurred. Please try again or contact support.
vi: Đã xảy ra lỗi không mong muốn. Vui lòng thử lại hoặc liên hệ hỗ trợ.

# httpErrorDefaultHint1
source: Try again after a few minutes
vi: Thử lại sau vài phút

# httpErrorDefaultHint2
source: Check internet connection
vi: Kiểm tra kết nối internet

# httpErrorDefaultHint3
source: Contact support with error code {code}
vi: Liên hệ bộ phận hỗ trợ với mã lỗi {code}

# filterTitle
source: Filters
vi: Bộ lọc

source: Filter by name
vi: Lọc theo tên

# filterNameHint
source: Enter name to search...
vi: Nhập tên để tìm kiếm...

source: Filter by status
vi: Lọc theo trạng thái

# filterShowError
source: Show error monitors
vi: Hiển thị monitor OFFLINE

# filterShowErrorDesc
source: Items with errors (status = -1)
vi: Các item có lỗi

# filterShowSuccess
source: Show success monitors
vi: Hiển thị monitor ONLINE

# filterShowSuccessDesc
source: Items with success (status = 1)
vi: Các item thành công

source: Filter by enable status
vi: Lọc theo trạng thái kích hoạt

# filterShowEnabled
source: Show enabled monitors
vi: Hiển thị monitor đang bật theo dõi

# filterShowEnabledDesc
source: Items with enable = 1
vi: Các item có enable = 1

# filterShowDisabled
source: Show disabled monitors
vi: Hiển thị monitor tắt theo dõi

# filterShowDisabledDesc
source: Items with enable = 0
vi: Các item có enable = 0

# filterResetAll
source: Reset All
vi: Đặt lại tất cả

# filterClear
source: Clear
vi: Xóa

# filterShowing
source: Showing
vi: Hiển thị

# filterOf
source: of
vi: của

# filterName
source: Name:
vi: Tên:

# filterErrorItems
source: Error items
vi: Items lỗi

# filterSuccessItems
source: Success items
vi: Items thành công

# filterEnabledItems
source: Enabled items
vi: Items đã kích hoạt

# filterDisabledItems
source: Disabled items
vi: Items đã vô hiệu hóa

# filterNoMatch
source: No items match the filter
vi: Không có item nào khớp với bộ lọc

# filterClearFilters
source: Clear filters
vi: Xóa bộ lọc
